In [2]:
import pandas as pd

student_list = [
    {'name': 'John', 'major': "Computer Science", 'sex': "male"},
    {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
    {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
    {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
    {'name': 'John', 'major': "Computer Science", 'sex': "male"},                
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [4]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [5]:
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [8]:
student_list = [
    {'name': 'John', 'major': "Computer Science", 'sex': "male"},
    {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
    {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
    {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
    {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
    {'name': 'Nate', 'major': None, 'sex': "male"},
    {'name': 'John', 'major': "Economics", 'sex': "male"}
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [9]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [10]:
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [12]:
df.drop_duplicates(['name'], keep='last')

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [ ]:
df.drop_duplicates(['name'])